In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as px

In [16]:
#default 0 - pagou 1 - n√£o pagou
base_credit = pd.read_csv('database/credit_data_save.csv')
base_credit.mean()

Unnamed: 0      999.500000
clientid       1000.500000
income        45331.600018
age              40.927700
loan           4444.369695
default           0.141500
dtype: float64

In [3]:
base_credit.isnull().sum()

Unnamed: 0    0
clientid      0
income        0
age           3
loan          0
default       0
dtype: int64

In [18]:
base_credit.loc[pd.isnull(base_credit['age'])]

    Unnamed: 0  clientid        income  age         loan  default
28          28        29  59417.805406  NaN  2082.625938        0
30          30        31  48528.852796  NaN  6155.784670        0
31          31        32  23526.302555  NaN  2862.010139        0

In [19]:
base_credit['age'].fillna(base_credit['age'].mean(),inplace=True)

In [20]:
base_credit.loc[(base_credit['clientid']==29) | (base_credit['clientid']==31) | (base_credit['clientid']==32) ]

    Unnamed: 0  clientid        income      age         loan  default
28          28        29  59417.805406  40.9277  2082.625938        0
30          30        31  48528.852796  40.9277  6155.784670        0
31          31        32  23526.302555  40.9277  2862.010139        0

In [21]:
base_credit.loc[base_credit['clientid'].isin([29,31,32])]

    Unnamed: 0  clientid        income      age         loan  default
28          28        29  59417.805406  40.9277  2082.625938        0
30          30        31  48528.852796  40.9277  6155.784670        0
31          31        32  23526.302555  40.9277  2862.010139        0

In [22]:
base_credit.to_csv('database/credit_data_save.csv')